app/controllers/topics_controller.rb

SELECT "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @topics = Topic.find(params[:id])